import { lib, game, ui, get, ai, _status } from '../../../../../noname.js';
import { Styled } from '../../tool/basic.js';

function B(text) {
    return Styled('b', text);
}

export const connectBanned = [];
export const characterSort = {
    'lit': {
        'lit_ybs': ['lit_qbQb', 'lit_zhangshengjie张盛杰', 'lit_zhangqinyi张钦奕', 'lit_pangjianlong庞建龙', 'lit_zigao自高', 'lit_zengpinjia曾品嘉',
            'lit_liuchenmu刘晨沐', 'lit_zhengmohan郑墨翰', 'lit_ritaRita', 'lit_hupan胡畔', 'lit_lanboxun兰柏勋', 'lit_huxinyu胡馨予', 'lit_hujunwei胡峻玮',
            'lit_wangrong王荣', 'lit_jianghaixu蒋海旭', 'lit_qianbaocan钱保灿', 'lit_zhangchi张驰', 'lit_yangxiangling杨湘铃', 'lit_sunnan孙楠'],
        'lit_sdp': ['lit_wuxiaoqi伍小戚', 'lit_boshu菠树'],
        // 羲烨、牉
        'lit_jbs': ['lit_zhangchi9张驰', 'lit_wangcan9王灿', 'lit_liyang9李洋', 'lit_zhangshengjie9张盛杰', 'lit_chenke陈可', 'lit_linmiao林淼'],
    },
};


export const characterTitle = {

    'lit_qbQb': `卖血·控人·${Styled('y', "中")}`,
    'lit_zhangshengjie张盛杰': `跳判定·发育流·${Styled('o', "较难")}`,
    'lit_zhangqinyi张钦奕': `控血·爆发·${Styled('b', "较易")}`,
    'lit_pangjianlong庞建龙': `控场·强杀·${Styled('g', "易")}`,
    'lit_wuxiaoqi伍小戚': `换牌·复活·亡语·${Styled('b', "较易")}`,

    'lit_zigao自高': `补牌·辅助·${Styled('o', "较难")}`,
    'lit_zengpinjia曾品嘉': `凑牌·追击·${Styled('y', "中")}`,
    'lit_boshu菠树': `辅助·反伤·过牌·${Styled('o', "较难")}`,
    'lit_liuchenmu刘晨沐': `辅助·干扰·${Styled('y', "中")}`,
    'lit_zhengmohan郑墨翰': `过牌·回血·爆发·${Styled('b', "较易")}`,

    'lit_ritaRita': `装备·补牌·爆发·${Styled('g', "易")}`,
    'lit_hupan胡畔': `反击·续航·${Styled('o', "较难")}`,
    'lit_lanboxun兰柏勋': `扒牌·顺风压制·${Styled('g', "易")}`,
    'lit_huxinyu胡馨予': `拆牌·消耗·${Styled('y', "中")}`,
    'lit_hujunwei胡峻玮': `改判·爆发·强杀·${Styled('b', "较易")}`,

    'lit_wangrong王荣': `过牌·控人·强杀·${Styled('y', "中")}`,
    'lit_jianghaixu蒋海旭': `防拆·补牌·复活·${Styled('y', "中")}`,
    'lit_qianbaocan钱保灿': `群伤·爆发·${Styled('b', "较易")}`,
    'lit_zhangchi张驰': `拆牌·反伤·${Styled('o', "较难")}`,
    'lit_yangxiangling杨湘铃': `控人·斩杀·连破·${Styled('o', "较难")}`,

    'lit_sunnan孙楠': `追击·连杀·${Styled('o', "较难")}`,

};

export const characterIntro = {

    'lit_qbQb': `前期被防御类和爆发类克制，防御类让${B("Qb")}不容易发动${get.poptip("lit_tianna")}回血，爆发类容易让${B("Qb")}血量回不上来。后期升级后有名刀，而且有机会收残血，只要${B("Qb")}有伤害牌，回血难度会降一些。`
        + "<li>主公：建议适当屯牌，不一定回满血，只要保证不会被一套带走，就可以留牌用于在回合内造成伤害。毕竟你还可以让你的“忠臣”们自愿给你献血，前期没那么容易死的"
        + "<li>反贼：血量上限更低，回合外要尽可能保证满血。多与队友配合，最好间隔一轮卖血控不同的人，压制对面的配合"
        + "<li>忠臣、内奸：跟主公和反贼差不多，不过要优先针对威胁最大的敌方，保证主公生存要紧",
    'lit_zhangshengjie张盛杰': `以延时锦囊为核心构筑的爆发型角色。${B("张盛杰")}通过${get.poptip("lit_wutou")}跳过判定阶段，能在判定区积累延时锦囊置，配合`
        + `${get.poptip("lit_youxia")}主动移牌补充判定区资源，快速积累${get.poptip("lit_xinyi")}觉醒。觉醒后是极具毁灭性的多刀控场输出。`
        + "<li>主公：发育相对较快，觉醒后可以不着急输出，凑多一点延时锦囊牌输出便指数上升。前后期都亟需保护，建议优先拿装备牌发育再觉醒"
        + "<li>忠臣、反贼：可以捡队友判定区的垃圾来发育，觉醒后一波心痕爆发可以收割残血或压制核心敌方"
        + "<li>内奸：前期低调积累延时锦囊，觉醒后利用高爆发清理战场，注意保留关键延时锦囊以备最终决战",
    'lit_zhangqinyi张钦奕': `卖血？？白银狮子？！遇到他们不要怕，只要${B("张钦奕")}2血，薄纱！全部薄纱！`
        + `<li>主公：在真人局，开场几乎就能逼其他人跳身份了，但这似乎是唯一的优点，不然遇到带有${get.poptip("lit_shichou")}的家伙，直接天崩开局`
        + "<li>忠臣：辅助卖血主公有奇效，除此之外可以挑对面的玻璃大炮来打"
        + "<li>反贼：在近主位说不定可以秒杀，只要队内有同性能记得留桃，就可以火攻自己万人迷"
        + "<li>内奸：屯桃等候时机，再突然爆发，也许能瞬间进主内对决。只要主公没卖血、没复活或者名刀等，就算有再多防御牌都挡不住",
    'lit_pangjianlong庞建龙': `什么超级吕布，摸牌白罢了。不过${B("庞建龙")}比较适合新手，乱打也容易出伤害，尤其针对不清楚技能出两张牌机制的人`
        + "<li>主公、内奸：适当决斗控场，对有杀但是杀不多的人，记得让自己来决斗"
        + "<li>忠臣：放AOE前先看看主公状态，可千万不能坑主公"
        + "<li>反贼：负责捣乱就好了",
    'lit_wuxiaoqi伍小戚': `天呐，他真恶心！甚至能复活！赶快留点垃圾牌恶心他！要是${B("伍小戚")}费尽心思换来的牌全是废牌，他才能真正体会到${get.poptip("lit_xiaochou")}`
        + `的滋味！`
        + `<li>主公：别急着用牌，等没血或者输出型队友没牌的时候再发动技能，千万别提前把${get.poptip("lit_mianju")}用完了，不然少一个复活`
        + "<li>忠臣：开头有复活，后期有亡语，直接给主公递牌就好了。不过不要乱开技能，把好牌换废牌就舒服了"
        + "<li>反贼、内奸：直接用光牌，然后给别人底裤都扒下来。当然了，最好祈祷没人会因此发动神秘索敌技",

    'lit_zigao自高': `如果没人理${B("自高")}，而他又打不出伤害，那很可能被活活拖死。他自带两种模式：牌少回血拿对手牌，牌多扣血送队友牌；对于缺牌的对手和牌多的队友有奇效，`
        + `不过有一定风险。`
        + `<li>主公：回合外的防御牌随便出，压低手牌方便回血。但是回合内的伤害牌不要乱用，尤其是AOE，通过${get.poptip("lit_xinren")}给队友开很关键。不仅可以联动队友的技能，而且队友造成的伤害也能防止回合内的崩血`
        + `<li>忠臣、反贼：主要辅助队友过牌，如果不能保证对手被控，或者让他打不出伤害，就要注意白送${get.poptip("lit_zhanshi")}的风险`
        + "<li>内奸：前期要会忍耐，升级后自己也有输出能力了，再打伤害。有些时候，手牌越少，手牌越多",
    'lit_zengpinjia曾品嘉': `${B("曾品嘉")}想要玩得舒服，又要牌运又要计算，联机时浪费时间，伤害高而慢……什么，铁索连环？只要没有${get.poptip("lit_zigaodebeixin")}`
        + `${get.poptip("lit_qbzhimao")}之类的技能，完全有可能“五连·诸天灭地”！`
        + `<li>主公：非常不建议当主公，在写此info的当前环境下（26.2.11）一轮下来的存活率不超过1成，除非队友特别合适。硬要玩的话记得多留防御牌，不要奢求打伤害`
        + "<li>忠臣、反贼、内奸：用好右上角的记牌器功能很关键。要尽量用牌，通常牌的点数越高越好，前期可以预先存一些点数为3~6的牌，升级后往往可以直接破敌",
    'lit_boshu菠树': `依赖${get.poptip("lit_guimi")}联动的爆发型角色。闺蜜在场时${B("菠树")}${get.poptip("lit_yisui")}锁定手牌数为3，且闺蜜满血时免疫伤害，防御和攻击能力没有看起来的那么不堪。通过合理选择闺蜜并控制手牌状态，菠树能通过连续摸牌来达到爆发的效果。升级后闺蜜死亡不再导致体力流失，能些微提高容错率。`
        + "<li>主公：完全不推荐，闺蜜给到反贼就废了一半。唯一能想到的打法是利用闺蜜+易碎摸7张初始牌的性质，用手气卡刷出AK突突全场"
        + "<li>忠臣：建议选主公为闺蜜，第一轮有闺蜜回血，主公牌满血相对容易。前期不用留太多防御牌，但后期要打输出必须先发育好装备"
        + "<li>反贼、内奸：开局不给主公闺蜜就跳了一半身份，建议选容易满血的角色为闺蜜。适应前置位，离主公近一点也没事，反正主公也不敢轻易动你",
    'lit_liuchenmu刘晨沐': `干扰对手，辅助队友造成伤害或者为其提供补益（如杀、桃、无中生有等），对付${B("刘晨沐")}时需注意好牌后出`
        + `<li>主公：在${get.poptip("lit_jijin")}的加持下开局可以盲杀，如果能造成伤害，下一张杀就没法杀你；如果血量比较低，回合外可以先不用技能，在别人吃桃或无中生有时再用`
        + "<li>忠臣、反贼：看队友的主要输出牌是什么，例如靠“杀”打伤害的，就可以帮他加“杀”的目标，从而最大化收益。借敌人的输出灭残血、让敌方互拆、偷桃、吊卡、无中生有等都是常规操作。此外，可以参考主公的玩法，杀对面来换取己方关键队友的防御"
        + `<li>内奸：前期嫖别人的补益牌来发育，到主内单挑的时候，“贯石斧”会是你的好朋友，主公一旦${get.poptip("lit_shouji")}，就很难再杀到你了`,
    'lit_zhengmohan郑墨翰': `每回合群体回血+制衡的收益很恐怖，因此跟${B("郑墨翰")}打消耗战很不现实，留点属性牌利用铁索打暴击通常比较好。对${B("郑墨翰")}自己而言，`
        + `专门控状态打爆发收益不一定高，${get.poptip("lit_jianren")}更多是个保下限的技能`
        + "<li>主公：利用加血活命，即便拖到主内对决都不慌，只要对面不是强命斩杀将，单挑问题不大"
        + "<li>忠臣、反贼：横置控场，血低时择机打爆发。如果确信伤害能中，即便是给对面先回1点血都不一定亏"
        + "<li>内奸：利用制衡屯牌，不要轻易掉血，后期就是主公打法",

    'lit_ritaRita': `${B("Rita")}是装备驱动的辅助型主公。${get.poptip("lit_nuoruo")}在中期能依靠其他角色顶装备来获取较多装备牌，供给${get.poptip("lit_hengshuiti")}`
        + `连续冰杀输出。作为主公技或升级技的${get.poptip("lit_dafang")}则是能给高输出队友补牌，或是以多手牌队友为跳板给自己回血，兼具团队续航与个人能力。`
        + "<li>主公：必要时让忠臣拆装备配合补牌，后期自身装备≈1张杀+半个桃，不急着拿人头可以不着急装备"
        + "<li>忠臣、反贼：前期爆发能力较弱，可以老实当一个控场角色，中后期再收人头并辅助队友补牌"
        + "<li>内奸：前期控场，在最后单挑时的「懦弱」能恶心主公的装备体系，控制得当可以达成爆发+摸牌循环的效果",
    'lit_hupan胡畔': `低血线但不吃桃的负嘲讽型狂战士，但被光着脚的1血角色，爆发和卖血类克制。${get.poptip("lit_cuiruo")}的${B("胡畔")}在回合内看似1血，实则差1血满血，`
        + `能配合${get.poptip("lit_shichou")}加强负嘲讽效果。升级后，降防御来换取${get.poptip("lit_yigou")}体系，能给吃上限的队友极大加成，自身也会演变为彻底的卖血杀杀杀角色。`
        + "<li>主公：负责活着，等到升级后再乱爆发。忠臣记得留桃，只要能活到下个回合，状态一下子就回来了"
        + "<li>忠臣：适当故意不闪承受伤害，但注意防御主公AOE，尤其是某个不可言说的主公，当他的忠臣比内奸还反贼"
        + "<li>反贼：碰瓷主公，升级后利用异构体系可以终结残血"
        + "<li>内奸：利用负嘲讽囤牌成为不动白，最后再爆发",
    'lit_lanboxun兰柏勋': `多拿AOE，杀藤甲和仁王盾仍能触发技能，以此可维持血量和手牌优势。因此限制${B("兰柏勋")}的方法也很简单，在升级前不击杀就别管，升级后只需要压血`
        + `拆牌就好了`
        + "<li>主公、内奸：适当杀人，放AOE来巩固自身地位。升级时相当于触发半个复活技，可以利用此机会爆发"
        + "<li>忠臣、反贼：作为简单的顺风输出位，如果有必要，在清楚队友有防御牌时可以杀队友弃负面牌",
    'lit_huxinyu胡馨予': `${B("胡馨予")}是拼点驱动的进攻型角色。通过拼点触发${get.poptip("lit_xukong")}的决斗效果，快速消耗双方的大量手牌并造成伤害，造成伤害后`
        + `如果还有手牌则能连续发动。升级后的闪与装备牌在拼点时视为K点，能大幅提升拼点胜率。消耗完手牌后，${get.poptip("lit_shihuai")}可索取他人手牌续航，保底2收益。`
        + "<li>主公、内奸：要留少量防御牌来保持威慑，同时可以慢慢积攒拼点机会，用于在中期发动虚空连击"
        + "<li>忠臣、反贼：可以多利用虚空拼点来消耗对手，装备牌视为K点的特性让拼点胜率极高，很容易收割残血",
    'lit_hujunwei胡峻玮': `判定控制与卖血结合的强命高伤害角色。${B("胡峻玮")}的${get.poptip("lit_wutong")}可拿体力或手牌换护甲来强制修改场上判定结果，配合${get.poptip("lit_biaoxian")}；`
        + `能做到刀刀暴击命中。此外的改判还能为团队解除延时锦囊威胁或强化自身输出，是兼具辅助与爆发的核心角色。`
        + "<li>主公：要留点血来作为手牌上限，不是收人头的时候不用那么激进地进攻，可惜回血和过牌不够，比较吃忠臣选将"
        + "<li>忠臣、反贼：只要自己不是1血就能打爆发，刀刀2伤害不知道有多恐怖"
        + "<li>内奸：前期可以玩成辅助，到必要的时候改判控场，血留到主内单挑的时候用",

    'lit_wangrong王荣': `${B("王荣")}集“控场”“过牌”“输出”为一身，虽然在特定环境下才能发挥出最大的威力，但其综合能力并不弱。对付他时要谨慎使用判定技能，优先拆他的武器和-1马`
        + `<li>主公：开场几乎一定要转移${get.poptip("lit_diaogui")}，然后可以对攻击范围内嘲讽较高的角色使用${get.poptip("lit_qixu")}来换牌。如果因此判闪电劈到忠臣了，那就当是“吊诡”发力了吧`
        + `<li>忠臣、反贼、内奸：控人拿牌，拿到${get.poptip("lit_zhijian")}之后就有输出了`,
    'lit_jianghaixu蒋海旭': `如果己方队友是${B("蒋海旭")}，那每回合都相当于有一次卖血技。而且${B("蒋海旭")}的补牌技能在濒死之前触发，对能转化桃的队友很友好。还能防止队友弃牌，不过对${get.poptip("lit_boshu菠树")}、${get.poptip("lit_huxinyu胡馨予")}之类的得考虑考虑。`
        + `<li>主公、反贼：除非受到巨额爆伤，否则前期几乎死不掉，而且队友在有${get.poptip("lit_yuanzhu")}的情况下，对${B("蒋海旭")}的桃相当于能用两次.可多补牌，援助容易蓄牌的队友`
        + "<li>忠臣、内奸：辅助主公，但有可能把主公的桃抢了……因此在主公血量危急的时候尽量别被打进濒死了",
    'lit_qianbaocan钱保灿': `锦囊特化的多目标多刀输出角色。${B("钱保灿")}一旦${get.poptip("lit_chushou")}就能跳过摸牌阶段直接声明使用普通锦囊，不可被无懈；再通过${get.poptip("lit_zhixun")}来控场或是追刀，升级后还能增加杀的目标数，配合${get.poptip("lit_male")}能做到跳过摸牌阶段，但比其他人的摸牌阶段能摸更多牌。`
        + "<li>主公、忠臣：第一回合建议留牌，看清身份后到次轮再爆发。队友如果能为牌多添目标，那爆发力度会几何倍数增长"
        + "<li>反贼：南蛮+万箭后可乱杀主公，一轮残是常有的事，主公的一轮生存率就是这么被拉低的"
        + "<li>内奸：留牌，进可南蛮万箭，退可五谷桃园，AOE在关键时候都可以用来控场",
    'lit_zhangchi张驰': `与${B("氹")}诡辩之时，你会怀念仁王盾和藤甲的。什么？你卖血啊~那没事了，${B("氹")}最怕的就是不怕自己会反伤自己的人`
        + `<li>主公：留防御牌方便${get.poptip("lit_guibian")}。${get.poptip("lit_shuxin")}改为主动技后，要小心发动技能对使用者的真实收益`
        + "<li>忠臣：诡辩反贼的伤害牌，吸引火力以便进行消耗战"
        + "<li>反贼：诡辩酒、闪、无懈可击，或满血诡辩桃100%成功。可以显著干扰对面关键人物的牌型"
        + "<li>内奸：有竖心在很容易苟到最后，苟吧",
    'lit_yangxiangling杨湘铃': `前期约等于没有技能，想杀${B("杨湘铃")}要趁早，就算是队友也可能被AOE误伤。一旦${B("杨湘铃")}到了后期，可以显著提高敌方的斩杀线，对手的血量变化完全可能为5→4→3→2→-2→-3→-4……非常适合打消耗战`
        + `<li>主公：前期只考虑活下来，及时翻面高嘲讽敌方。后期可以亲自下场，利用${get.poptip("lit_dongjie")}掉血效果杀到忠臣也不怕`
        + "<li>忠臣、反贼：及时补刀残血，可以造成双倍伤害，不过很多时候人头不会是你的，人头算的是「使其从正常状态进入濒死状态并在最终死亡」的伤害源"
        + "<li>内奸：比较容易发死人财，找准机会连破定胜",

    'lit_sunnan孙楠': `${B("孙楠")}通过${get.poptip("lit_jiaoshui")}从他人处获取资源，配合${get.poptip("lit_zhishu")}将回合外获得的牌转化为“枝”牌进行输出。${get.poptip("lit_gonghuo")}能为敌人施加负面标记，在合适的时机造成额外伤害。`
        + "<li>主公：利用浇水收集资源，枝疏提供持续输出，注意保持攻击范围以触发枝疏的配合效果"
        + "<li>忠臣、反贼：通过拱火为关键敌人施加烂根标记，配合队友的出杀打爆发伤害，自己可利用枝疏②在回合外连续出杀"
        + "<li>内奸：枝疏提供的额外牌资源有助于后期单挑，注意控制“枝”牌数量",

}
export const characterReplace = {
    'lit_zhangshengjie': ['lit_zhangshengjie张盛杰', 'lit_zhangshengjie9张盛杰'],
    'lit_zhangchi': ['lit_zhangchi张驰', 'lit_zhangchi9张驰'],
};

// 暂时于precontent集中处理
export const characterFilter = {
    // xxx(mode) {
    //	 return mode != 'guozhan';
    // },
};

// 特殊时机皮肤切换
export const characterSubstitute = {
    // 'lit_jianghaixu蒋海旭' : [["azure",[`img: ${ basic.path }/image/character / lit_jianghaixu_azure.png`]]],
};

// 珠联璧合
export const perfectPair = {
    'lit_qbQb': ["lit_zigao自高", "lit_hujunwei胡峻玮"],
    'lit_zigao自高': ["lit_zengpinjia曾品嘉", "lit_lanboxun兰柏勋"],
    'lit_ritaRita': ["lit_huxinyu胡馨予", "lit_yangxiangling杨湘铃"],
    'lit_zengpinjia曾品嘉': ["lit_chenke陈可", "lit_qianbaocan钱保灿"],
    'lit_hupan胡畔': ["lit_zhengmohan郑墨翰"],
    'lit_zhangchi9张驰': ["lit_zhangchi张驰", "lit_liyang9李洋"],
    'lit_yangxiangling杨湘铃': ["lit_linmiao林淼"],
};